---
kind: property
id: P:Autodesk.Revit.DB.ForgeTypeId.TypeId
source: html/166624ff-caa2-3af3-694c-5fd89ce79865.htm
---
# Autodesk.Revit.DB.ForgeTypeId.TypeId Property

The schema identifier.

## Syntax (C#)
```csharp
public string TypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null